francisduvivier/arduino-esp32-fri3d/boards.txt
fri3d_2024_esp32s3.menu.UploadMode.default=UART0 / Hardware CDC
fri3d_2024_esp32s3.menu.UploadMode.default.upload.use_1200bps_touch=false
fri3d_2024_esp32s3.menu.UploadMode.default.upload.wait_for_upload_port=false
fri3d_2024_esp32s3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
fri3d_2024_esp32s3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
fri3d_2024_esp32s3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

fri3d_2024_esp32s3.menu.PartitionScheme.fri3d=Fri3d 16MB (OTA + Micropyhton + Retrogame)
fri3d_2024_esp32s3.menu.PartitionScheme.fri3d.build.partitions=fri3d_partitions_16MB
fri3d_2024_esp32s3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
fri3d_2024_esp32s3.menu.PartitionScheme.default.build.partitions=default
fri3d_2024_esp32s3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
fri3d_2024_esp32s3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
fri3d_2024_esp32s3.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
fri3d_2024_esp32s3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
fri3d_2024_esp32s3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
fri3d_2024_esp32s3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
fri3d_2024_esp32s3.menu.PartitionScheme.minimal.build.partitions=minimal
fri3d_2024_esp32s3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
fri3d_2024_esp32s3.menu.PartitionScheme.no_ota.build.partitions=no_ota
fri3d_2024_esp32s3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
fri3d_2024_esp32s3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
fri3d_2024_esp32s3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
fri3d_2024_esp32s3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
fri3d_2024_esp32s3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
fri3d_2024_esp32s3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
fri3d_2024_esp32s3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
fri3d_2024_esp32s3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
fri3d_2024_esp32s3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
fri3d_2024_esp32s3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
fri3d_2024_esp32s3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
fri3d_2024_esp32s3.menu.PartitionScheme.huge_app.build.partitions=huge_app
fri3d_2024_esp32s3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
fri3d_2024_esp32s3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
fri3d_2024_esp32s3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
fri3d_2024_esp32s3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
fri3d_2024_esp32s3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
fri3d_2024_esp32s3.menu.PartitionScheme.fatflash.build.partitions=ffat
fri3d_2024_esp32s3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
fri3d_2024_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
fri3d_2024_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
fri3d_2024_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728


fri3d_2024_esp32s3.menu.CPUFreq.240=240MHz (WiFi)
fri3d_2024_esp32s3.menu.CPUFreq.240.build.f_cpu=240000000L
fri3d_2024_esp32s3.menu.CPUFreq.160=160MHz (WiFi)
fri3d_2024_esp32s3.menu.CPUFreq.160.build.f_cpu=160000000L
fri3d_2024_esp32s3.menu.CPUFreq.80=80MHz (WiFi)
fri3d_2024_esp32s3.menu.CPUFreq.80.build.f_cpu=80000000L
fri3d_2024_esp32s3.menu.CPUFreq.40=40MHz
fri3d_2024_esp32s3.menu.CPUFreq.40.build.f_cpu=40000000L
fri3d_2024_esp32s3.menu.CPUFreq.20=20MHz
fri3d_2024_esp32s3.menu.CPUFreq.20.build.f_cpu=20000000L
fri3d_2024_esp32s3.menu.CPUFreq.10=10MHz
fri3d_2024_esp32s3.menu.CPUFreq.10.build.f_cpu=10000000L

fri3d_2024_esp32s3.menu.UploadSpeed.921600=921600
fri3d_2024_esp32s3.menu.UploadSpeed.921600.upload.speed=921600
fri3d_2024_esp32s3.menu.UploadSpeed.115200=115200
fri3d_2024_esp32s3.menu.UploadSpeed.115200.upload.speed=115200
fri3d_2024_esp32s3.menu.UploadSpeed.256000.windows=256000
fri3d_2024_esp32s3.menu.UploadSpeed.256000.upload.speed=256000
fri3d_2024_esp32s3.menu.UploadSpeed.230400.windows.upload.speed=256000
fri3d_2024_esp32s3.menu.UploadSpeed.230400=230400
fri3d_2024_esp32s3.menu.UploadSpeed.230400.upload.speed=230400
fri3d_2024_esp32s3.menu.UploadSpeed.460800.linux=460800
fri3d_2024_esp32s3.menu.UploadSpeed.460800.macosx=460800
fri3d_2024_esp32s3.menu.UploadSpeed.460800.upload.speed=460800
fri3d_2024_esp32s3.menu.UploadSpeed.512000.windows=512000
fri3d_2024_esp32s3.menu.UploadSpeed.512000.upload.speed=512000

fri3d_2024_esp32s3.menu.DebugLevel.none=None
fri3d_2024_esp32s3.menu.DebugLevel.none.build.code_debug=0
fri3d_2024_esp32s3.menu.DebugLevel.error=Error
fri3d_2024_esp32s3.menu.DebugLevel.error.build.code_debug=1
fri3d_2024_esp32s3.menu.DebugLevel.warn=Warn
fri3d_2024_esp32s3.menu.DebugLevel.warn.build.code_debug=2
fri3d_2024_esp32s3.menu.DebugLevel.info=Info
fri3d_2024_esp32s3.menu.DebugLevel.info.build.code_debug=3
fri3d_2024_esp32s3.menu.DebugLevel.debug=Debug
fri3d_2024_esp32s3.menu.DebugLevel.debug.build.code_debug=4
fri3d_2024_esp32s3.menu.DebugLevel.verbose=Verbose
fri3d_2024_esp32s3.menu.DebugLevel.verbose.build.code_debug=5

fri3d_2024_esp32s3.menu.EraseFlash.none=Disabled
fri3d_2024_esp32s3.menu.EraseFlash.none.upload.erase_cmd=
fri3d_2024_esp32s3.menu.EraseFlash.all=Enabled
fri3d_2024_esp32s3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

##############################################################
#### LILYGO T8 ESP32S2 with SD card ####
lilygo_t8_esp32s2.name=ESP32S2 Dev Module
lilygo_t8_esp32s2.vid.0=0x303a
lilygo_t8_esp32s2.pid.0=0x0002

lilygo_t8_esp32s2.bootloader.tool=esptool_py
lilygo_t8_esp32s2.bootloader.tool.default=esptool_py

lilygo_t8_esp32s2.upload.tool=esptool_py
lilygo_t8_esp32s2.upload.tool.default=esptool_py
lilygo_t8_esp32s2.upload.tool.network=esp_ota

lilygo_t8_esp32s2.upload.maximum_size=1310720
lilygo_t8_esp32s2.upload.maximum_data_size=327680
lilygo_t8_esp32s2.upload.flags=
lilygo_t8_esp32s2.upload.extra_flags=
lilygo_t8_esp32s2.upload.use_1200bps_touch=false
lilygo_t8_esp32s2.upload.wait_for_upload_port=false

lilygo_t8_esp32s2.serial.disableDTR=false
lilygo_t8_esp32s2.serial.disableRTS=false

lilygo_t8_esp32s2.build.tarch=xtensa
lilygo_t8_esp32s2.build.bootloader_addr=0x1000
lilygo_t8_esp32s2.build.target=esp32s2
lilygo_t8_esp32s2.build.mcu=esp32s2
lilygo_t8_esp32s2.build.core=esp32
lilygo_t8_esp32s2.build.variant=esp32s2
lilygo_t8_esp32s2.build.board=LILYGO_T8_ESP32S2

lilygo_t8_esp32s2.build.cdc_on_boot=0
lilygo_t8_esp32s2.build.msc_on_boot=0
lilygo_t8_esp32s2.build.dfu_on_boot=0
lilygo_t8_esp32s2.build.f_cpu=240000000L
lilygo_t8_esp32s2.build.flash_size=4MB
lilygo_t8_esp32s2.build.flash_freq=80m
lilygo_t8_esp32s2.build.flash_mode=dio
lilygo_t8_esp32s2.build.boot=qio
lilygo_t8_esp32s2.build.partitions=default
lilygo_t8_esp32s2.build.defines=

## IDE 2.0 Seems to not update the value
lilygo_t8_esp32s2.menu.JTAGAdapter.default=Disabled
lilygo_t8_esp32s2.menu.JTAGAdapter.default.build.copy_jtag_files=0
lilygo_t8_esp32s2.menu.JTAGAdapter.external=FTDI Adapter
lilygo_t8_esp32s2.menu.JTAGAdapter.external.build.openocdscript=esp32s2-kaluga-1.cfg
lilygo_t8_esp32s2.menu.JTAGAdapter.external.build.copy_jtag_files=1
lilygo_t8_esp32s2.menu.JTAGAdapter.bridge=ESP USB Bridge
lilygo_t8_esp32s2.menu.JTAGAdapter.bridge.build.openocdscript=esp32s2-bridge.cfg
lilygo_t8_esp32s2.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

lilygo_t8_esp32s2.menu.CDCOnBoot.default=Disabled
lilygo_t8_esp32s2.menu.CDCOnBoot.default.build.cdc_on_boot=0
lilygo_t8_esp32s2.menu.CDCOnBoot.cdc=Enabled
lilygo_t8_esp32s2.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

