francisduvivier/arduino-esp32-fri3d/boards.txt
lilygo_t8_esp32s2.menu.MSCOnBoot.default=Disabled
lilygo_t8_esp32s2.menu.MSCOnBoot.default.build.msc_on_boot=0
lilygo_t8_esp32s2.menu.MSCOnBoot.msc=Enabled
lilygo_t8_esp32s2.menu.MSCOnBoot.msc.build.msc_on_boot=1

lilygo_t8_esp32s2.menu.DFUOnBoot.default=Disabled
lilygo_t8_esp32s2.menu.DFUOnBoot.default.build.dfu_on_boot=0
lilygo_t8_esp32s2.menu.DFUOnBoot.dfu=Enabled
lilygo_t8_esp32s2.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

lilygo_t8_esp32s2.menu.UploadMode.default=UART0
lilygo_t8_esp32s2.menu.UploadMode.default.upload.use_1200bps_touch=false
lilygo_t8_esp32s2.menu.UploadMode.default.upload.wait_for_upload_port=false
lilygo_t8_esp32s2.menu.UploadMode.cdc=Internal USB
lilygo_t8_esp32s2.menu.UploadMode.cdc.upload.use_1200bps_touch=true
lilygo_t8_esp32s2.menu.UploadMode.cdc.upload.wait_for_upload_port=true

lilygo_t8_esp32s2.menu.PSRAM.disabled=Disabled
lilygo_t8_esp32s2.menu.PSRAM.disabled.build.defines=

lilygo_t8_esp32s2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
lilygo_t8_esp32s2.menu.PartitionScheme.default.build.partitions=default
lilygo_t8_esp32s2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
lilygo_t8_esp32s2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
lilygo_t8_esp32s2.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
lilygo_t8_esp32s2.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
lilygo_t8_esp32s2.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
lilygo_t8_esp32s2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
lilygo_t8_esp32s2.menu.PartitionScheme.minimal.build.partitions=minimal
lilygo_t8_esp32s2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
lilygo_t8_esp32s2.menu.PartitionScheme.no_ota.build.partitions=no_ota
lilygo_t8_esp32s2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
lilygo_t8_esp32s2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
lilygo_t8_esp32s2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
lilygo_t8_esp32s2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
lilygo_t8_esp32s2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
lilygo_t8_esp32s2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
lilygo_t8_esp32s2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
lilygo_t8_esp32s2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
lilygo_t8_esp32s2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
lilygo_t8_esp32s2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
lilygo_t8_esp32s2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
lilygo_t8_esp32s2.menu.PartitionScheme.huge_app.build.partitions=huge_app
lilygo_t8_esp32s2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
lilygo_t8_esp32s2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
lilygo_t8_esp32s2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
lilygo_t8_esp32s2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
lilygo_t8_esp32s2.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
lilygo_t8_esp32s2.menu.PartitionScheme.fatflash.build.partitions=ffat
lilygo_t8_esp32s2.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
lilygo_t8_esp32s2.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
lilygo_t8_esp32s2.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
lilygo_t8_esp32s2.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
lilygo_t8_esp32s2.menu.PartitionScheme.rainmaker=RainMaker
lilygo_t8_esp32s2.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
lilygo_t8_esp32s2.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

lilygo_t8_esp32s2.menu.CPUFreq.240=240MHz (WiFi)
lilygo_t8_esp32s2.menu.CPUFreq.240.build.f_cpu=240000000L
lilygo_t8_esp32s2.menu.CPUFreq.160=160MHz (WiFi)
lilygo_t8_esp32s2.menu.CPUFreq.160.build.f_cpu=160000000L
lilygo_t8_esp32s2.menu.CPUFreq.80=80MHz (WiFi)
lilygo_t8_esp32s2.menu.CPUFreq.80.build.f_cpu=80000000L
lilygo_t8_esp32s2.menu.CPUFreq.40=40MHz
lilygo_t8_esp32s2.menu.CPUFreq.40.build.f_cpu=40000000L
lilygo_t8_esp32s2.menu.CPUFreq.20=20MHz
lilygo_t8_esp32s2.menu.CPUFreq.20.build.f_cpu=20000000L
lilygo_t8_esp32s2.menu.CPUFreq.10=10MHz
lilygo_t8_esp32s2.menu.CPUFreq.10.build.f_cpu=10000000L

lilygo_t8_esp32s2.menu.FlashMode.qio=QIO
lilygo_t8_esp32s2.menu.FlashMode.qio.build.flash_mode=dio
lilygo_t8_esp32s2.menu.FlashMode.qio.build.boot=qio

lilygo_t8_esp32s2.menu.FlashFreq.80=80MHz
lilygo_t8_esp32s2.menu.FlashFreq.80.build.flash_freq=80m
lilygo_t8_esp32s2.menu.FlashFreq.40=40MHz
lilygo_t8_esp32s2.menu.FlashFreq.40.build.flash_freq=40m

lilygo_t8_esp32s2.menu.FlashSize.4M=4MB (32Mb)
lilygo_t8_esp32s2.menu.FlashSize.4M.build.flash_size=4MB
lilygo_t8_esp32s2.menu.FlashSize.8M=8MB (64Mb)
lilygo_t8_esp32s2.menu.FlashSize.8M.build.flash_size=8MB
lilygo_t8_esp32s2.menu.FlashSize.8M.build.partitions=default_8MB
lilygo_t8_esp32s2.menu.FlashSize.2M=2MB (16Mb)
lilygo_t8_esp32s2.menu.FlashSize.2M.build.flash_size=2MB
lilygo_t8_esp32s2.menu.FlashSize.2M.build.partitions=minimal
lilygo_t8_esp32s2.menu.FlashSize.16M=16MB (128Mb)
lilygo_t8_esp32s2.menu.FlashSize.16M.build.flash_size=16MB


lilygo_t8_esp32s2.menu.UploadSpeed.115200=115200
lilygo_t8_esp32s2.menu.UploadSpeed.115200.upload.speed=115200
lilygo_t8_esp32s2.menu.UploadSpeed.921600=921600
lilygo_t8_esp32s2.menu.UploadSpeed.921600.upload.speed=921600
lilygo_t8_esp32s2.menu.UploadSpeed.256000.windows=256000
lilygo_t8_esp32s2.menu.UploadSpeed.256000.upload.speed=256000
lilygo_t8_esp32s2.menu.UploadSpeed.230400.windows.upload.speed=256000
lilygo_t8_esp32s2.menu.UploadSpeed.230400=230400
lilygo_t8_esp32s2.menu.UploadSpeed.230400.upload.speed=230400
lilygo_t8_esp32s2.menu.UploadSpeed.460800.linux=460800
lilygo_t8_esp32s2.menu.UploadSpeed.460800.macosx=460800
lilygo_t8_esp32s2.menu.UploadSpeed.460800.upload.speed=460800
lilygo_t8_esp32s2.menu.UploadSpeed.512000.windows=512000
lilygo_t8_esp32s2.menu.UploadSpeed.512000.upload.speed=512000

lilygo_t8_esp32s2.menu.DebugLevel.none=None
lilygo_t8_esp32s2.menu.DebugLevel.none.build.code_debug=0
lilygo_t8_esp32s2.menu.DebugLevel.error=Error
lilygo_t8_esp32s2.menu.DebugLevel.error.build.code_debug=1
lilygo_t8_esp32s2.menu.DebugLevel.warn=Warn
lilygo_t8_esp32s2.menu.DebugLevel.warn.build.code_debug=2
lilygo_t8_esp32s2.menu.DebugLevel.info=Info
lilygo_t8_esp32s2.menu.DebugLevel.info.build.code_debug=3
lilygo_t8_esp32s2.menu.DebugLevel.debug=Debug
lilygo_t8_esp32s2.menu.DebugLevel.debug.build.code_debug=4
lilygo_t8_esp32s2.menu.DebugLevel.verbose=Verbose
lilygo_t8_esp32s2.menu.DebugLevel.verbose.build.code_debug=5

lilygo_t8_esp32s2.menu.EraseFlash.none=Disabled
lilygo_t8_esp32s2.menu.EraseFlash.none.upload.erase_cmd=
lilygo_t8_esp32s2.menu.EraseFlash.all=Enabled
lilygo_t8_esp32s2.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
